// Напишите программу, которая выводит случайное трёхзначное число 
// и удаляет вторую цифру этого числа.
// 456 -> 46
// 782 -> 72
// 918 -> 98

int number = new Random().Next(100,1000);
string str = number.ToString();

Console.WriteLine($"{number} -> {str[0]}{str[2]}");